In [1]:
import pandas as pd
import sqlite3

In [4]:
# Create a SQL connection to our SQLite database
con = sqlite3.connect("data/quotes.sqlite")

cur = con.cursor()

# The result of a "cursor.execute" can be iterated over by row
# for row in cur.execute('SELECT * FROM quotes;'):
#     print(row)

# Be sure to close the connection
# con.close()

In [5]:
df = pd.read_sql_query("SELECT * from quotes", con)
df.head()

,QUOTE,AUTHOR,TITLE,LIKES,TAGS
0,“My life amounts to no more than one drop in a...,David Mitchell,Cloud Atlas,4589,None
1,“A half-read book is a half-finished love affa...,David Mitchell,Cloud Atlas,3181,"['love', 'reading']"
2,“Our lives are not our own. We are bound to ot...,David Mitchell,Cloud Atlas,2534,None
3,"“Travel far enough, you meet yourself.”",David Mitchell,Cloud Atlas,1547,['travel']
4,"“Books don't offer real escape, but they can s...",David Mitchell,Cloud Atlas,1490,"['escape', 'reading']"

In [6]:
df.isnull().sum()

QUOTE     0
AUTHOR    0
TITLE     0
LIKES     0
TAGS      0
dtype: int64

In [7]:
df['TITLE'].unique()

array(['Cloud Atlas', 'Black Swan Green', 'The Bone Clocks', ...,
       'Mirror, Mirror on the Wall: Women Writers Explore Their Favorite Fairy Tales',
       'The Beastly Bride: Tales of the Animal People', 'White as Snow'],
      dtype=object)